import random

happiness = [
    "خوب",
    "خوشحال",
    "شاد",
    "خندان",
    "عالی",
    "خوشبخت",
    "خوش",
]
sadness = [
    "بد",
    "ناراحت",
    "غم",
    "غمگین",
    "آشفته",
    "پریشان"
]

yes = [
    "بله",
    "آره",
    "اره"
]

no = [
    "خیر",
    "نه"
]

positive_emotions = [
    "HAPPY"
]

negative_emotions = [
    "SAD"
]

recent = [
    "اخیرا",
    "تازگی",
    "تازگیا",
    "تازه",
    "نزدیک"
]

long_time = [
    "خیلی",
    "پیش",
    "قدیما",
    "قدیم",
    "خیلی وقت پیش"
]


greeting = [
            "سلام",
            "سلااام",
            "سلام من قراره بهت کمک کنم",
            "درود",
]

feeling = [
   "حالت چطوره؟",
    "چه احساسی داری؟",
    "حال امروزت چطور هست؟"
]

emotion_verifier = [
    "آیا احساس X می‌کنی؟",
    "آیا حس X داری؟"
]

tell_emotion = [
    "ناراحتی یا خوشحالی؟"
]

if_need_any_protocols = [
    "آیا نیاز به تمرینی داری؟",
    "آیا به تمرینی احتیاج داری؟"
]


event = [
    "متاسفم که می شنوم حال شما خوب نیست. آیا اتفاق خاصی رخ داده است که این احساس را در شما ایجاد کند؟",
    "آیا اتفاق خاصی افتاده که شما را غمگین کند؟ راحت به من بگویید.",
]

time = [
    "آیا این احساسات حاصل اتفاقی است که اخیراً رخ داده یا مدت ها پیش؟",
    "آیا می توانید به من بگویید که آیا این احساسات خاص ناشی از رویدادی است که اخیراً رخ داده است یا مدت زمان طولانی تری؟",
]

protocol_titles = [
            "۰: تمرین خاصی توصیه نمی‌شود.",
            "۱: یادآوری خاطرات کودکی",
            "۲: در آغوش گرفتن و آرامش دادن به کودک",
            "۳: خواندن یک موسیقی محبت‌آمیز",
            "۴: ابراز حس محبت و مراقبت از کودک",
            "۵: تعهد به حمایت و مراقبت از کودک",
            "۶: بازیابی دنیای عاطفی ما",
            "۷: حفظ رابطه محبت آمیز با کودک و ایجاد اشتیاق برای زندگی",
            "۸: لذت بردن از طبیعت",
            "۱۰: از پس دردهای گذشته برآمدن",
            "۱۱: آرامش عضلانی و صورت شاد برای خندیدن عمدی",
            "۱۲: خنده پیروزی بر خودمان",
            "۱۳: خندیدن با خود کودکی‌مان",
            "۱۴: خنده عمدی",
            "۱۵: یاد بگیریم دیدگاه‌های خودمان را تغییر دهیم.",
            "۱۶: یاد بگیریم در مورد دردهای گذشته‌مان شاد باشیم.",
            "۱۷: شناسایی الگوهای بروز نارضایتی های شخصی",
            "۱۸: برنامه ریزی برای اقدامات سازنده‌تر",
            "۱۹: به روز رسانی باورهای سفت و سخت ما برای افزایش خلاقیت",
            "۲۰: تمرین عبارات تاکیدی",
            "۲۱: شناسایی و مهار احساسات آزاردهنده داخلی",
            "۲۲: حل بحران های شخصی",
            "۲۳: کشف خود واقعی و مستقل در این زمان اضطرار",
        ]

protocols = [
            ["نیازی به توصیه‌ای نیست."],
            ["در مکانی ساکت به عکس های شاد و ناراحت خود نگاه کنید. خاطرات مثبت و منفی دوران کودکی و روابط اولیه در خانواده را به یاد آورید."],
            [
                "۲- الف:",
                  "(۱) با چشمان بسته ابتدا عکس یا آواتار شاد خود را تصور کنید و تصور کنید کودک در نزدیکی شماست.",
                  "(۲) حالا تصور کنید کودک را در آغوش گرفته اید.",
                  "(۳) حالا تصور کنید که دارید با کودک بازی می کنید، به عنوان مثال؛ بازی‌هایی که در کودکی انجام داده اید.",
                  "(۴) حالا تصور کنید در حال رقصیدن با کودک هستید.",
                  "در مورد احساس خود در هر مرحله از (۱) تا (۴) فکر کنید.",
                "۲- ب:",
                  "(۱) با چشمان بسته، عکس یا آواتار ناراضی خود را تصور کنید که کودک نزدیک شماست.",
                  "(۲) حالا تصور کنید که کودک را در آغوش گرفته و دلداری می دهید.",
                  "(۳) چشمان خود را باز کنید، عینک گوگل را روی صورتتان بگذارید.",
                    "(الف) یک احساس منفی (غمگین، عصبانی، ترسناک یا منزجر کننده) روی آواتار خود قرار دهید.",
                    "(ب) سپس بر روی «احساسات خودکار» کلیک کنید و با خیره شدن به آواتار کودک خود تصور کنید که به کودک خود اطمینان و آرامش می دهید که باعث خوشحالی و در نهایت رقص کودک می شود.",
                  "در مورد احساس خود در هر مرحله از (۱) تا (۳) فکر کنید.",
            ],
            ["کپی هایی از عکس شاد را برای نمایش در خانه، محل کار و کیف پول خود چاپ کنید. در نظر بگیرید که تصویر دیجیتال آن را به‌عنوان پس‌زمینه روی تلفن و لپ‌تاپ خود و غیره تنظیم کنید. آهنگ غزلی شادی را که دوست دارید انتخاب کنید و احساسات گرما، محبت، عشق را القا کند. آهنگ را از زبان بیاموزید و تا جایی که می توانید آن را در برنامه روزانه خود بخوانید. در حالی که به عکس/آواتار شاد نگاه می کنید، آهنگ را بخوانید تا راهی برای ایجاد پیوند عاطفی عمیق با کودک در ذهن خود داشته باشید. بی سر و صدا شروع کنید؛ سپس، با گذشت زمان، اجازه دهید صدایتان بلندتر شود، در حالی که بیشتر از بدن خود استفاده می کنید (مثلاً شانه ها، دستان خود را تکان دهید، و ابروهای خود را بالا و پایین ببرید). تصور کنید که به این ترتیب، مانند یک والدین، گفتگوی پرشور و محبت آمیز دارید و با شادی با کودک می رقصید و بازی می کنید."],
            ["در حالی که صادقانه به عکس یا آواتار شاد لبخند می زنید، با صدای بلند به فرزندتان بگویید: «من عاشقانه دوستت دارم و عمیقاً به تو اهمیت می دهم»."],
            ["در این تمرین ما شروع به مراقبت از کودک مانند فرزند خود می کنیم. ما احساسات خود را به کودک نسبت می دهیم و فرافکنی می کنیم. ما به عنوان خود بالغ خود، با تعهدی که در زمان و مکان خاص می دهیم شروع می کنیم. پس از خواندن بی سر و صدا، ما با اطمینان این را با صدای بلند متعهد می‌شویم: «از این به بعد، به‌دنبال این هستم که به‌عنوان یک والدین فداکار و دوست داشتنی نسبت به این کودک عمل کنم و به‌طور پیوسته و از صمیم قلب به هر طریق ممکن از آنها مراقبت کنم. من تمام تلاشم را برای حمایت از سلامت و رشد عاطفی این کودک انجام خواهم داد.»"],
            ["از طریق تخیل یا با نقاشی، دنیای عاطفی خود را خانه ای با قسمت های متروکه ای در نظر بگیرید که به طور کامل آن را بازسازی خواهید کرد. خانه جدید در نظر گرفته شده است تا در مواقع پریشانی پناهگاهی امن برای کودک و پایگاهی امن برای کودک برای مقابله با چالش های زندگی فراهم کند. خانه جدید و باغ آن روشن و آفتابی است. ما تصور می کنیم که این تمرینات دلبستگی خود را در این محیط انجام دهیم. زیرزمین بازسازی نشده خانه جدید بقایای خانه متروکه است و حاوی احساسات منفی ماست. هنگامی که احساسات منفی را تحمل می کنید، تصور کنید که کودک در زیرزمین به دام افتاده است، اما می تواند به تدریج یاد بگیرد که در زیرزمین را باز کند، بیرون برود و وارد اتاق های روشن شود و دوباره با بزرگسالان متحد شود."],
            [
                "۷- الف: چند عبارت کوتاه را انتخاب کنید، به عنوان مثال، «تو فرزند زیبای من هستی» یا «عشق من». در حالی که به عکس با آواتار شاد نگاه می کنید، آن را به آرامی، با صدای بلند، حداقل پنج بار بگویید. سپس آهنگ عشق مورد علاقه خود را حداقل پنج بار بخوانید. مانند قبل، حجم خود را افزایش دهید و شروع به استفاده از کل بدن خود کنید.",
                "۷- ب: در حالی که در آینه نگاه می کنید، تصویر خود را شبیه کودک (یعنی خود احساسی شما) تصور کنید، سپس شروع به خواندن آهنگ انتخابی قبلی خود با صدای بلند کنید. مانند قبل، حجم خود را افزایش دهید و شروع به استفاده از کل بدن خود کنید. (اگر تصور کودک در آینه برایتان سخت است، عکس «شاد» کودک خود را در مقابل آینه قرار دهید و تمرین را انجام دهید و در حالی که به عکس کودکی شاد خود در آینه نگاه می کنید). این کار را دو بار در حال حاضر و سپس تا آنجا که ممکن است در شرایط مختلف در طول روز انجام دهید، مثلا در راه رفتن به محل کار یا هنگام پختن شام، تا آنها را در زندگی جدید خود ادغام کنید. هنگامی که خواندن آهنگ مورد علاقه شما به عادت شما تبدیل می شود، به ابزاری موثر برای تقویت تأثیرات مثبت و مدیریت احساسات تبدیل می شود.",
            ],
            ["ایجاد دلبستگی به طبیعت برای فرزندتان راهی موثر برای افزایش شادی و کاهش احساسات منفی است. در یک روز این هفته، به یک پارک محلی، جنگل یا جنگل بروید. حداقل 5 دقیقه را صرف تحسین یک درخت کنید و سعی کنید زیبایی واقعی آن را که قبلاً هرگز تجربه نکرده اید قدردانی کنید. این فرآیند را از جمله با سایر جنبه های طبیعت (مانند آسمان، ستاره ها، گیاهان، پرندگان، رودخانه ها، دریا، حیوان مورد علاقه خود) تکرار کنید تا زمانی که احساس کنید به طبیعت دلبستگی پیدا کرده اید که به تنظیم احساسات شما کمک می کند. دستیابی به این امر به شما کمک می کند که پس از پایان این دوره زمان بیشتری را در طبیعت بگذرانید."],
            [
                "با چشمان بسته، عکس یا آواتار ناراضی را تصور کنید و احساسات منفی خود را به عکس یا آواتار ناخوشایند نشان دهید.",
                "در حین انجام این کار:",
                "(۱) با صدای بلند به کودک اطمینان دهید.",
                "(۲) صورت/گردن/سر خود را ماساژ دهید.",
                "این مراحل را تا زمانی که آرام شوید تکرار کنید.",
            ],
            [
                "با چشمان بسته، یک قسمت دردناک دوران کودکی، مانند آزار عاطفی یا فیزیکی یا از دست دادن یک چهره مهم را با تمام جزئیاتی که هنوز به خاطر دارید، به یاد بیاورید. چهره کودکی که در گذشته بودید را با عکس یا آواتار ناراضی انتخاب شده مرتبط کنید. همانطور که احساسات مرتبط مانند درماندگی، تحقیر و خشم را با چشمان بسته به یاد می آورید، بزرگسال خود را تصور کنید که مانند یک والدین خوب در صحنه دخالت می کند.",
                "بزرگسالی خود را تصویر کنید:",
                   "(۱) مثل هر پدر و مادر خوبی که فرزندش در مضیقه است به سرعت به فرزند خود نزدیک شوید.",
                   "(۲) با صدای بلند به کودک اطمینان می دهید که اکنون برای نجات او آمده اید، با ایستادن با صدای بلند در مقابل هر عاملی، به عنوان مثال: «چرا فرزندم را می زنی؟» و برای مثال با حمایت از کودک با صدای بلند: «عزیزم، من دیگر نمی گذارم آنها به تو آسیب برسانند».",
                   "(۳) با خود ماساژ دادن صورت/گردن/سر، کودکتان را با تخیل در آغوش بگیرید.",
                "(۱)، (۲)، (۳) را تا زمانی که آرامش و تسکین پیدا کنید، تکرار کنید و بر ضربه تسلط پیدا کنید.",
            ],
            ["صبح زود مانند یک کودک رفتار کنید: عضلات صورت و بدن را شل کنید، دهان خود را باز کنید و آهنگ مورد علاقه خود را در حالی که می خندید (یا حداقل لبخند می زنید) بخوانید."],
            ["بلافاصله پس از انجام کاری، به عنوان مثال. انجام کارهای خانه، گفت‌وگو با همسایه یا خواندن مقاله، با تصور اینکه این یک دستاورد است، لبخند بزنید، سپس وقتی راحت شدید، حداقل برای ده ثانیه شروع به خندیدن کنید."],
            ["با نگاه کردن به عکس یا آواتار شاد خود، لبخند بزنید و سپس برای حداقل ده ثانیه شروع به خندیدن کنید. این روند را حداقل سه بار تکرار کنید."],
            ["زمانی که تنها هستید، دهان خود را کمی باز کنید، ماهیچه های صورت خود را شل کنید، ابروهای خود را بالا بیاورید، سپس به آرامی و به طور مداوم یکی از صداهای زیر را تکرار کنید که هر کدام از آنها حداقل انرژی را مصرف می کند: «ها، هه، اها، هه» یا «ها، ها، ها، ها»; یا «هو، هو، هو، هو»؛ یا «هی، هی، هی، هی» یا «یا، یا، یا، یا». اگر به موضوعی برای خندیدن نیاز دارید، می توانید به حماقت تمرین بخندید! هنگامی که این خنده عمدی مداوم به یک عادت تبدیل می شود، می توانید آن را مطابق با شخصیت و سبک خود شکل دهید تا برند خنده خود را ایجاد کنید."],
            ["به گلدان سیاه خیره شوید. لحظه ای که درک شما تغییر می کند و دو چهره سفید را می بینید که بزرگسال و کودک هستند و به یکدیگر نگاه می کنند (IT، ST، PT) بخندید یا حداقل برای یک دقیقه لبخند بزنید. به دو صورت سفید خیره شوید و لحظه ای که درک شما تغییر کرد و گلدان سیاه (IT, ST) را دیدید، بخندید یا حداقل یک دقیقه لبخند بزنید."],
            ["رویداد دردناکی را که در گذشته رخ داده است تجسم کنید (ممکن است یک رویداد اخیر باشد که با آن دست و پنجه نرم کرده اید یا یک رویداد دردناک که در دوران کودکی شما رخ داده و مدت زیادی تحمل کرده اید) و با وجود دردناک بودن آن، سعی کنید تاثیر مثبتی که برای شما داشته است را ببینید. از هر یک از تئوری ها برای طنز استفاده کنید تا در آن رویداد بخندید یا حداقل لبخند بزنید."],
            ["سعی کنید هر گونه الگویی از احساسات خودشیفته و ضد اجتماعی را که فرزندتان در روابط فعلی یا گذشته شما انجام داده است یا هر گونه کینه طولانی مدتی که علیه کسی ایجاد شده است، شناسایی کنید. سعی کنید تشخیص دهید که چه مقدار از زمان و انرژی شما صرف این گونه رفتارها و رنجش می شود."],
            [
                "روش جدیدی را برای مدیریت در آینده با آنچه که به عنوان احساسات ضد اجتماعی یا نارضایتی شخصی در زندگی خود شناسایی کرده اید، ایجاد کنید.",
                "۱- بدون انکار این احساسات، سعی کنید آنها را بازتاب دهید و در خود نگه دارید و از اعمال آنها بپرهیزید. سعی کنید کینه شخصی را کنار بگذارید. این ممکن است سخت و چالش برانگیز باشد اما برای رشد عاطفی ضروری است. در اینجا، شما موضعی انتقادی اما سازنده نسبت به فرزند خود می گیرید و شفقت آینده نگری را اعمال می کنید.",
                "۲- راهی مثبت برای هدایت مجدد انرژی پرخاشگرانه ناشی از این احساسات به کار مولد (مثلاً رفتن برای ورزش کردن، صحبت با یک دوست و غیره) و در نهایت به کار خلاقانه در جهت هدف والای خود در زندگی پیدا کنید.",
            ],
            ["چارچوب ایدئولوژیک معمول خود را به چالش بکشید تا هر گونه الگوی اعتقادی یک طرفه را تضعیف کنید و خودانگیختگی و بررسی هر موضوعی را از منظرهای چندگانه تشویق کنید. این کار را با موضوعات یا مضامینی که اعتقادات ریشه‌ای در مورد آنها دارید و همچنین به آن‌ها علاقه دارید، تمرین کنید. این ممکن است شامل هر موضوع اجتماعی، سیاسی یا اخلاقی مانند ازدواج، گرایش جنسی یا نژادپرستی باشد. به عنوان مثال، دیدگاه سیاسی شما در مورد یک موضوع خاص هر چه باشد، موضوع را از دیدگاه لیبرال و محافظه کار و یا از دیدگاه جناح چپ و راست در نظر بگیرید و سعی کنید هر دو طرف موضوع را درک کنید و چارچوب ایدئولوژیک غالب خود را به چالش بکشید. این بدان معنا نیست که دیدگاه خود را تغییر دهید، اما به شما امکان می دهد موضوع را از منظرهای مختلف ببینید و بتوانید خود را به جای دیگران قرار دهید. هر روز حداقل به مدت 5 دقیقه یک سوال یا موضوع متفاوت را در نظر بگیرید."],
            ["فهرستی از جملات تاکیدی الهام‌بخش توسط چهره‌هایی که تحسین می‌کنید جمع آوری کنید. سه موردی را انتخاب کنید که بیشتر به شما الهام می بخشد. آنها را بخوانید و به آرامی برای حداقل سه دقیقه تکرار کنید."],
            [
                "بزرگسال از جنبه های مثلث تروما آگاه می شود: آزار دهنده داخلی، قربانی و نجات دهنده.",
                "بزرگسال تأثیرات این مثلث (خودشیفتگی و عدم خلاقیت) را در زندگی روزمره و تجربیات قبلی بررسی می کند.",
                "بزرگسالان تجربیات مهم زندگی و دیدگاه های اجتماعی و سیاسی خود را در بزرگسالی با آگاهی از نحوه عملکرد آزاردهنده داخلی مرور می کند.",
                "بزرگسالان فهرستی از نمونه ها را از تجربیات خود برای چهار روش مختلف که آزاردهنده داخلی عمل می کند ایجاد می کند.",
                "بزرگسالان تجربیات زندگی خود را به دقت تجزیه و تحلیل می کند تا نمونه هایی از آسیب دیدن، آسیب دیدگی توسط آزاردهنده داخلی و فرافکنی آزاردهنده درونی به دیگران باشد.",
                "بر اساس موارد فوق، بزرگسالان دوباره تجربیات خود را ارزیابی می کنند، شامل آزار و اذیت درونی، ذهنیت قربانی و بازی های سرزنش می شوند که امکان توسعه خلاقیت را فراهم می کند.",
            ],
            [
                "بعد از اینکه سطح برانگیختگی کودک کاهش یافت و همچنان که به تمرین برای تعدیل عواطف منفی و تمرینات خنده ادامه دادیم، از کودک خود موارد زیر را می خواهیم:",
                "- چگونه می توانید بحران را راهی برای قوی تر شدن ببینید؟ (ها ها ها).",
                "- چگونه می توانید بحران را راهی برای رسیدن به هدف والای خود تعبیر کنید؟ (ها ها ها).",
                "- آیا آزاردهنده داخلی دوباره به دیگران فرافکنی کرده است؟",
                "بزرگسال سوالات زیر را می پرسد:",
                "- شباهت این بحران با بحران هایی که قبلاً با آن مواجه شده ام چیست؟",
                "- چقدر شبیه بحران خانوادگی است که در کودکی تجربه کردم؟",
                "- آیا ویژگی های مثبت طرف مقابل بیشتر از ویژگی های منفی او نیست؟",
                "- یک فرد بالغ چگونه بحران را در مقایسه با فرزند من تفسیر می کند؟",
                "- آیا می توانم آن را از منظر دیگری ببینم؟",
                "- آیا می توانم خودم را جای آنها بگذارم و تأثیرات آنها را درک کنم؟",
                "- با توجه به بینش جدیدم، آیا می توانم راهی برای آرام کردن افراد درگیر در بحران پیدا کنم تا بتوانیم راه حل بهتری برای آن پیدا کنیم؟",
                "- اگر نمی توانم، آیا می توانم با احترام فاصله خود را حفظ کنم و به مشاجره یا درگیری پایان دهم؟",
            ],
            [
                "بزرگسال ما از فرزندمان می پرسد که آیا منطقی است که مطیع سیستم سودآوری فوق العاده ای باشیم که ما را به ورطه کنونی رسانده است؟",
                "آیا من واقعاً به همه این محصولات، اشیاء و خدمات مورد نظر به دنبال پیام‌های بی‌شمار و فشارهای همسالان یا فشارهای اجتماعی بر من نیاز دارم؟",
                "آیا زمانی که زندگی در خطر نابودی قریب‌الوقوع است، میل به یک سبک زندگی مادی‌گرا یا لذت‌پرستانه و خودخواهانه منطقی است؟",
                "آیا می‌خواهیم به این بازی مادی‌گرایانه صفر ادامه دهیم یا می‌خواهیم اهداف والای خود را در رسیدگی به مشکلات وجودی خود دنبال کنیم؟",
                "آیا ما می‌توانیم سیاره زنده را نجات دهیم جز با کار در جهت یک قرارداد اجتماعی جدید جهانی مبتنی بر شفقت جهانی که در آن می‌توان تهاجم انسانی را به خلاقیت برای خیر عمومی تبدیل کرد؟",
            ],
        ]


def sentiment_analysis(message):
    for h in happiness:
        if h in message:
            return "HAPPY"
    for s in sadness:
        if s in message:
            return "SAD"
    return "NEUTRAL"

def yes_no_detection(message):
    for y in yes:
        if y in message:
            return "YES"
    for n in no:
        if n in message:
            return "NO"


def check_emotion_positiveness(emo):
    for p in positive_emotions:
        if emo == p:
            return "POS"
    for n in negative_emotions:
        if emo == n:
            return "NEG"


def check_event_time(message):
    for r in recent:
        if r in message:
            return "RECENT"
    for l in long_time:
        if l in message:
            return "NOT_RECENT"


def protocol_generator(p_num):
    res = "\n\n" + protocol_titles[p_num] + "\n\n"
    for p in protocols[p_num]:
        res += p
        res += "\n"
    return res


emotion = ""
# suggested_protocol_pool = []

def information_retrieval_module(state, message, suggested_protocol_pool):
    global emotion
    if state == "GREETING": # Greeting
        return random.choice(greeting), "FEELING", suggested_protocol_pool
    elif state == "FEELING": # Feeling
        return random.choice(feeling), "EMOTION_VERIFIER", suggested_protocol_pool
    elif state == "EMOTION_VERIFIER":
        if sentiment_analysis(message) == "HAPPY":
            emotion = "HAPPY"
            return random.choice(emotion_verifier).replace("X", "خوشحالی"), "EMOTION_VERIFIER2", suggested_protocol_pool
        elif sentiment_analysis(message) == "SAD":
            emotion = "SAD"
            return random.choice(emotion_verifier).replace("X", "ناراحتی"), "EMOTION_VERIFIER2", suggested_protocol_pool
        elif sentiment_analysis(message) == "NEUTRAL":
            emotion = "NEUTRAL"
            return "آیا احساس خاصی نداری؟", "EMOTION_VERIFIER2", suggested_protocol_pool
    elif state == "EMOTION_VERIFIER2":
        if yes_no_detection(message) == "YES":
            if check_emotion_positiveness(emotion) == "POS":
                return random.choice(if_need_any_protocols), "IF_NEED_ANY_PROTOCOLS", suggested_protocol_pool
            elif check_emotion_positiveness(emotion) == "NEG":
                return random.choice(event), "EVENT", suggested_protocol_pool
        elif yes_no_detection(message) == "NO":
            return random.choice(tell_emotion), "EMOTION_DETECTOR", suggested_protocol_pool
    elif state == "EMOTION_DETECTOR":
        if check_emotion_positiveness(emotion) == "POS":
            return random.choice(if_need_any_protocols), "IF_NEED_ANY_PROTOCOLS", suggested_protocol_pool
        elif check_emotion_positiveness(emotion) == "NEG":
            return random.choice(event), "EVENT", suggested_protocol_pool
    elif state == "IF_NEED_ANY_PROTOCOLS":
        if yes_no_detection(message) == "YES":
            suggested_protocol_pool.append(8)
            suggested_protocol_pool.append(9)
            suggested_protocol_pool.append(10)
            return "بریم برای توصیه‌ها؟", "PROTOCOL_SUGGESTING", suggested_protocol_pool
        if yes_no_detection(message) == "NO":
            return "ممنون که باهام صحبت کردی :)", "END", suggested_protocol_pool
    elif state == "EVENT":
        if yes_no_detection(message) == "YES":
            return random.choice(time), "EVENT_TIME", suggested_protocol_pool
        if yes_no_detection(message) == "NO":
            return "متشکرم. بازم سوال بپرسم؟", "ADDITIONAL", suggested_protocol_pool
    elif state == "EVENT_TIME":
        if check_event_time(message) == "RECENT":
            return "آیا تمرین ۱۱ باعث ناراحتی شما می‌شود؟" + protocol_generator(10), "PROTOCOL_11", suggested_protocol_pool
        if check_event_time(message) == "NOT_RECENT":
            return "آیا تمرین ۶ باعث ناراحتی شما می‌شود؟" + protocol_generator(5), "PROTOCOL_6", suggested_protocol_pool
    elif state == "PROTOCOL_11":
        if yes_no_detection(message) == "YES":
            suggested_protocol_pool.append(6)
            suggested_protocol_pool.append(7)
            return "متشکرم. بازم سوال بپرسم؟", "ADDITIONAL", suggested_protocol_pool
        if yes_no_detection(message) == "NO":
            suggested_protocol_pool.append(10)
            return "متشکرم. بازم سوال بپرسم؟", "ADDITIONAL", suggested_protocol_pool
    elif state == "PROTOCOL_6":
        if yes_no_detection(message) == "YES":
            suggested_protocol_pool.append(12)
            suggested_protocol_pool.append(16)
            return "متشکرم. بازم سوال بپرسم؟", "ADDITIONAL", suggested_protocol_pool
        if yes_no_detection(message) == "NO":
            suggested_protocol_pool.append(5)
            return "متشکرم. بازم سوال بپرسم؟", "ADDITIONAL", suggested_protocol_pool
    elif state == "ADDITIONAL":
        return "کافیه :)", "PROTOCOL_SUGGESTING", suggested_protocol_pool
    elif state == "PROTOCOL_SUGGESTING":
        res_protocols = ""
        print(suggested_protocol_pool)
        for i in suggested_protocol_pool:
            res_protocols += protocol_generator(i)
            res_protocols += "\n"
        return res_protocols, "END", suggested_protocol_pool
    elif state == "END":
        return "ممنون که باهام صحبت کردی :)", "END2", suggested_protocol_pool
    elif state == "END2":
        return "امیدوارم تونسته باشم کمکت کنم.", "END2", suggested_protocol_pool
    return

def user_input(state):
    if state == 0: # Greeting
        return input()
    elif state == 1: # Feeling
        return input()
    elif state == 2:
        return input()
    elif state == 3:
        print("۱. آره تازه بوده")
        print("۲. نه برای خیلی وقت پیشه.")
        return input("شماره ۱ یا ۲ رو وارد کنید.\n")
    elif state == 4:
        return
    return

